yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_i2c0.h
/* Register offsets *********************************************************/

#define RP2040_I2C0_IC_CON_OFFSET                 0x000000  /* I2C Control Register. This register can be written only when the DW_apb_i2c is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  Read/Write Access: - bit 10 is read only. - bit 11 is read only - bit 16 is read only - bit 17 is read only - bits 18 and 19 are read only. */
#define RP2040_I2C0_IC_TAR_OFFSET                 0x000004  /* I2C Target Address Register  This register is 12 bits wide, and bits 31:12 are reserved. This register can be written to only when IC_ENABLE[0] is set to 0.  Note: If the software or application is aware that the DW_apb_i2c is not using the TAR address for the pending commands in the Tx FIFO, then it is possible to update the TAR address even while the Tx FIFO has entries (IC_STATUS[2]= 0). - It is not necessary to perform any write to this register if DW_apb_i2c is enabled as an I2C slave only. */
#define RP2040_I2C0_IC_SAR_OFFSET                 0x000008  /* I2C Slave Address Register */
#define RP2040_I2C0_IC_DATA_CMD_OFFSET            0x000010  /* I2C Rx/Tx Data Buffer and Command Register; this is the register the CPU writes to when filling the TX FIFO and the CPU reads from when retrieving bytes from RX FIFO.  The size of the register changes as follows:  Write: - 11 bits when IC_EMPTYFIFO_HOLD_MASTER_EN=1 - 9 bits when IC_EMPTYFIFO_HOLD_MASTER_EN=0 Read: - 12 bits when IC_FIRST_DATA_BYTE_STATUS = 1 - 8 bits when IC_FIRST_DATA_BYTE_STATUS = 0 Note: In order for the DW_apb_i2c to continue acknowledging reads, a read command should be written for every byte that is to be received; otherwise the DW_apb_i2c will stop acknowledging. */
#define RP2040_I2C0_IC_SS_SCL_HCNT_OFFSET         0x000014  /* Standard Speed I2C Clock SCL High Count Register */
#define RP2040_I2C0_IC_SS_SCL_LCNT_OFFSET         0x000018  /* Standard Speed I2C Clock SCL Low Count Register */
#define RP2040_I2C0_IC_FS_SCL_HCNT_OFFSET         0x00001c  /* Fast Mode or Fast Mode Plus I2C Clock SCL High Count Register */
#define RP2040_I2C0_IC_FS_SCL_LCNT_OFFSET         0x000020  /* Fast Mode or Fast Mode Plus I2C Clock SCL Low Count Register */
#define RP2040_I2C0_IC_INTR_STAT_OFFSET           0x00002c  /* I2C Interrupt Status Register  Each bit in this register has a corresponding mask bit in the IC_INTR_MASK register. These bits are cleared by reading the matching interrupt clear register. The unmasked raw versions of these bits are available in the IC_RAW_INTR_STAT register. */
#define RP2040_I2C0_IC_INTR_MASK_OFFSET           0x000030  /* I2C Interrupt Mask Register.  These bits mask their corresponding interrupt status bits. This register is active low; a value of 0 masks the interrupt, whereas a value of 1 unmasks the interrupt. */
#define RP2040_I2C0_IC_RAW_INTR_STAT_OFFSET       0x000034  /* I2C Raw Interrupt Status Register  Unlike the IC_INTR_STAT register, these bits are not masked so they always show the true status of the DW_apb_i2c. */
#define RP2040_I2C0_IC_RX_TL_OFFSET               0x000038  /* I2C Receive FIFO Threshold Register */
#define RP2040_I2C0_IC_TX_TL_OFFSET               0x00003c  /* I2C Transmit FIFO Threshold Register */
#define RP2040_I2C0_IC_CLR_INTR_OFFSET            0x000040  /* Clear Combined and Individual Interrupt Register */
#define RP2040_I2C0_IC_CLR_RX_UNDER_OFFSET        0x000044  /* Clear RX_UNDER Interrupt Register */
#define RP2040_I2C0_IC_CLR_RX_OVER_OFFSET         0x000048  /* Clear RX_OVER Interrupt Register */
#define RP2040_I2C0_IC_CLR_TX_OVER_OFFSET         0x00004c  /* Clear TX_OVER Interrupt Register */
#define RP2040_I2C0_IC_CLR_RD_REQ_OFFSET          0x000050  /* Clear RD_REQ Interrupt Register */
#define RP2040_I2C0_IC_CLR_TX_ABRT_OFFSET         0x000054  /* Clear TX_ABRT Interrupt Register */
#define RP2040_I2C0_IC_CLR_RX_DONE_OFFSET         0x000058  /* Clear RX_DONE Interrupt Register */
#define RP2040_I2C0_IC_CLR_ACTIVITY_OFFSET        0x00005c  /* Clear ACTIVITY Interrupt Register */
#define RP2040_I2C0_IC_CLR_STOP_DET_OFFSET        0x000060  /* Clear STOP_DET Interrupt Register */
#define RP2040_I2C0_IC_CLR_START_DET_OFFSET       0x000064  /* Clear START_DET Interrupt Register */
#define RP2040_I2C0_IC_CLR_GEN_CALL_OFFSET        0x000068  /* Clear GEN_CALL Interrupt Register */
#define RP2040_I2C0_IC_ENABLE_OFFSET              0x00006c  /* I2C Enable Register */
#define RP2040_I2C0_IC_STATUS_OFFSET              0x000070  /* I2C Status Register  This is a read-only register used to indicate the current transfer status and FIFO status. The status register may be read at any time. None of the bits in this register request an interrupt.  When the I2C is disabled by writing 0 in bit 0 of the IC_ENABLE register: - Bits 1 and 2 are set to 1 - Bits 3 and 10 are set to 0 When the master or slave state machines goes to idle and ic_en=0: - Bits 5 and 6 are set to 0 */
#define RP2040_I2C0_IC_TXFLR_OFFSET               0x000074  /* I2C Transmit FIFO Level Register This register contains the number of valid data entries in the transmit FIFO buffer. It is cleared whenever: - The I2C is disabled - There is a transmit abort - that is, TX_ABRT bit is set in the IC_RAW_INTR_STAT register - The slave bulk transmit mode is aborted The register increments whenever data is placed into the transmit FIFO and decrements when data is taken from the transmit FIFO. */
#define RP2040_I2C0_IC_RXFLR_OFFSET               0x000078  /* I2C Receive FIFO Level Register This register contains the number of valid data entries in the receive FIFO buffer. It is cleared whenever: - The I2C is disabled - Whenever there is a transmit abort caused by any of the events tracked in IC_TX_ABRT_SOURCE The register increments whenever data is placed into the receive FIFO and decrements when data is taken from the receive FIFO. */
#define RP2040_I2C0_IC_SDA_HOLD_OFFSET            0x00007c  /* I2C SDA Hold Time Length Register  The bits [15:0] of this register are used to control the hold time of SDA during transmit in both slave and master mode (after SCL goes from HIGH to LOW).  The bits [23:16] of this register are used to extend the SDA transition (if any) whenever SCL is HIGH in the receiver in either master or slave mode.  Writes to this register succeed only when IC_ENABLE[0]=0.  The values in this register are in units of ic_clk period. The value programmed in IC_SDA_TX_HOLD must be greater than the minimum hold time in each mode one cycle in master mode, seven cycles in slave mode for the value to be implemented.  The programmed SDA hold time during transmit (IC_SDA_TX_HOLD) cannot exceed at any time the duration of the low part of scl. Therefore the programmed value cannot be larger than N_SCL_LOW-2, where N_SCL_LOW is the duration of the low part of the scl period measured in ic_clk cycles. */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_OFFSET      0x000080  /* I2C Transmit Abort Source Register  This register has 32 bits that indicate the source of the TX_ABRT bit. Except for Bit 9, this register is cleared whenever the IC_CLR_TX_ABRT register or the IC_CLR_INTR register is read. To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first; RESTART must be enabled (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must be cleared (IC_TAR[10]).  Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, Bit 9 clears for one cycle and is then re-asserted. */
#define RP2040_I2C0_IC_SLV_DATA_NACK_ONLY_OFFSET  0x000084  /* Generate Slave Data NACK Register  The register is used to generate a NACK for the data part of a transfer when DW_apb_i2c is acting as a slave-receiver. This register only exists when the IC_SLV_DATA_NACK_ONLY parameter is set to 1. When this parameter disabled, this register does not exist and writing to the register's address has no effect.  A write can occur on this register if both of the following conditions are met: - DW_apb_i2c is disabled (IC_ENABLE[0] = 0) - Slave part is inactive (IC_STATUS[6] = 0) Note: The IC_STATUS[6] is a register read-back location for the internal slv_activity signal; the user should poll this before writing the ic_slv_data_nack_only bit. */
#define RP2040_I2C0_IC_DMA_CR_OFFSET              0x000088  /* DMA Control Register  The register is used to enable the DMA Controller interface operation. There is a separate bit for transmit and receive. This can be programmed regardless of the state of IC_ENABLE. */
#define RP2040_I2C0_IC_DMA_TDLR_OFFSET            0x00008c  /* DMA Transmit Data Level Register */
#define RP2040_I2C0_IC_DMA_RDLR_OFFSET            0x000090  /* I2C Receive Data Level Register */
#define RP2040_I2C0_IC_SDA_SETUP_OFFSET           0x000094  /* I2C SDA Setup Register  This register controls the amount of time delay (in terms of number of ic_clk clock periods) introduced in the rising edge of SCL - relative to SDA changing - when DW_apb_i2c services a read request in a slave-transmitter operation. The relevant I2C requirement is tSU:DAT (note 4) as detailed in the I2C Bus Specification. This register must be programmed with a value equal to or greater than 2.  Writes to this register succeed only when IC_ENABLE[0] = 0.  Note: The length of setup time is calculated using [(IC_SDA_SETUP - 1) * (ic_clk_period)], so if the user requires 10 ic_clk periods of setup time, they should program a value of 11. The IC_SDA_SETUP register is only used by the DW_apb_i2c when operating as a slave transmitter. */
#define RP2040_I2C0_IC_ACK_GENERAL_CALL_OFFSET    0x000098  /* I2C ACK General Call Register  The register controls whether DW_apb_i2c responds with a ACK or NACK when it receives an I2C General Call address.  This register is applicable only when the DW_apb_i2c is in slave mode. */
#define RP2040_I2C0_IC_ENABLE_STATUS_OFFSET       0x00009c  /* I2C Enable Status Register  The register is used to report the DW_apb_i2c hardware status when the IC_ENABLE[0] register is set from 1 to 0; that is, when DW_apb_i2c is disabled.  If IC_ENABLE[0] has been set to 1, bits 2:1 are forced to 0, and bit 0 is forced to 1.  If IC_ENABLE[0] has been set to 0, bits 2:1 is only be valid as soon as bit 0 is read as '0'.  Note: When IC_ENABLE[0] has been set to 0, a delay occurs for bit 0 to be read as 0 because disabling the DW_apb_i2c depends on I2C bus activities. */
#define RP2040_I2C0_IC_FS_SPKLEN_OFFSET           0x0000a0  /* I2C SS, FS or FM+ spike suppression limit  This register is used to store the duration, measured in ic_clk cycles, of the longest spike that is filtered out by the spike suppression logic when the component is operating in SS, FS or FM+ modes. The relevant I2C requirement is tSP (table 4) as detailed in the I2C Bus Specification. This register must be programmed with a minimum value of 1. */
#define RP2040_I2C0_IC_CLR_RESTART_DET_OFFSET     0x0000a8  /* Clear RESTART_DET Interrupt Register */
#define RP2040_I2C0_IC_COMP_PARAM_1_OFFSET        0x0000f4  /* Component Parameter Register 1  Note This register is not implemented and therefore reads as 0. If it was implemented it would be a constant read-only register that contains encoded information about the component's parameter settings. Fields shown below are the settings for those parameters */
#define RP2040_I2C0_IC_COMP_VERSION_OFFSET        0x0000f8  /* I2C Component Version Register */
#define RP2040_I2C0_IC_COMP_TYPE_OFFSET           0x0000fc  /* I2C Component Type Register */

/* Register definitions *****************************************************/

#define RP2040_I2C0_IC_CON                 (RP2040_I2C0_BASE + RP2040_I2C0_IC_CON_OFFSET)
#define RP2040_I2C0_IC_TAR                 (RP2040_I2C0_BASE + RP2040_I2C0_IC_TAR_OFFSET)
#define RP2040_I2C0_IC_SAR                 (RP2040_I2C0_BASE + RP2040_I2C0_IC_SAR_OFFSET)
#define RP2040_I2C0_IC_DATA_CMD            (RP2040_I2C0_BASE + RP2040_I2C0_IC_DATA_CMD_OFFSET)
#define RP2040_I2C0_IC_SS_SCL_HCNT         (RP2040_I2C0_BASE + RP2040_I2C0_IC_SS_SCL_HCNT_OFFSET)
#define RP2040_I2C0_IC_SS_SCL_LCNT         (RP2040_I2C0_BASE + RP2040_I2C0_IC_SS_SCL_LCNT_OFFSET)
#define RP2040_I2C0_IC_FS_SCL_HCNT         (RP2040_I2C0_BASE + RP2040_I2C0_IC_FS_SCL_HCNT_OFFSET)
#define RP2040_I2C0_IC_FS_SCL_LCNT         (RP2040_I2C0_BASE + RP2040_I2C0_IC_FS_SCL_LCNT_OFFSET)
#define RP2040_I2C0_IC_INTR_STAT           (RP2040_I2C0_BASE + RP2040_I2C0_IC_INTR_STAT_OFFSET)
#define RP2040_I2C0_IC_INTR_MASK           (RP2040_I2C0_BASE + RP2040_I2C0_IC_INTR_MASK_OFFSET)
#define RP2040_I2C0_IC_RAW_INTR_STAT       (RP2040_I2C0_BASE + RP2040_I2C0_IC_RAW_INTR_STAT_OFFSET)
#define RP2040_I2C0_IC_RX_TL               (RP2040_I2C0_BASE + RP2040_I2C0_IC_RX_TL_OFFSET)
#define RP2040_I2C0_IC_TX_TL               (RP2040_I2C0_BASE + RP2040_I2C0_IC_TX_TL_OFFSET)
#define RP2040_I2C0_IC_CLR_INTR            (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_INTR_OFFSET)
#define RP2040_I2C0_IC_CLR_RX_UNDER        (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_RX_UNDER_OFFSET)
#define RP2040_I2C0_IC_CLR_RX_OVER         (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_RX_OVER_OFFSET)
#define RP2040_I2C0_IC_CLR_TX_OVER         (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_TX_OVER_OFFSET)
#define RP2040_I2C0_IC_CLR_RD_REQ          (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_RD_REQ_OFFSET)
#define RP2040_I2C0_IC_CLR_TX_ABRT         (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_TX_ABRT_OFFSET)
#define RP2040_I2C0_IC_CLR_RX_DONE         (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_RX_DONE_OFFSET)
#define RP2040_I2C0_IC_CLR_ACTIVITY        (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_ACTIVITY_OFFSET)
#define RP2040_I2C0_IC_CLR_STOP_DET        (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_STOP_DET_OFFSET)
#define RP2040_I2C0_IC_CLR_START_DET       (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_START_DET_OFFSET)
#define RP2040_I2C0_IC_CLR_GEN_CALL        (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_GEN_CALL_OFFSET)
#define RP2040_I2C0_IC_ENABLE              (RP2040_I2C0_BASE + RP2040_I2C0_IC_ENABLE_OFFSET)
#define RP2040_I2C0_IC_STATUS              (RP2040_I2C0_BASE + RP2040_I2C0_IC_STATUS_OFFSET)
#define RP2040_I2C0_IC_TXFLR               (RP2040_I2C0_BASE + RP2040_I2C0_IC_TXFLR_OFFSET)
#define RP2040_I2C0_IC_RXFLR               (RP2040_I2C0_BASE + RP2040_I2C0_IC_RXFLR_OFFSET)
#define RP2040_I2C0_IC_SDA_HOLD            (RP2040_I2C0_BASE + RP2040_I2C0_IC_SDA_HOLD_OFFSET)
#define RP2040_I2C0_IC_TX_ABRT_SOURCE      (RP2040_I2C0_BASE + RP2040_I2C0_IC_TX_ABRT_SOURCE_OFFSET)
#define RP2040_I2C0_IC_SLV_DATA_NACK_ONLY  (RP2040_I2C0_BASE + RP2040_I2C0_IC_SLV_DATA_NACK_ONLY_OFFSET)
#define RP2040_I2C0_IC_DMA_CR              (RP2040_I2C0_BASE + RP2040_I2C0_IC_DMA_CR_OFFSET)
#define RP2040_I2C0_IC_DMA_TDLR            (RP2040_I2C0_BASE + RP2040_I2C0_IC_DMA_TDLR_OFFSET)
#define RP2040_I2C0_IC_DMA_RDLR            (RP2040_I2C0_BASE + RP2040_I2C0_IC_DMA_RDLR_OFFSET)
#define RP2040_I2C0_IC_SDA_SETUP           (RP2040_I2C0_BASE + RP2040_I2C0_IC_SDA_SETUP_OFFSET)
#define RP2040_I2C0_IC_ACK_GENERAL_CALL    (RP2040_I2C0_BASE + RP2040_I2C0_IC_ACK_GENERAL_CALL_OFFSET)
#define RP2040_I2C0_IC_ENABLE_STATUS       (RP2040_I2C0_BASE + RP2040_I2C0_IC_ENABLE_STATUS_OFFSET)
#define RP2040_I2C0_IC_FS_SPKLEN           (RP2040_I2C0_BASE + RP2040_I2C0_IC_FS_SPKLEN_OFFSET)
#define RP2040_I2C0_IC_CLR_RESTART_DET     (RP2040_I2C0_BASE + RP2040_I2C0_IC_CLR_RESTART_DET_OFFSET)
#define RP2040_I2C0_IC_COMP_PARAM_1        (RP2040_I2C0_BASE + RP2040_I2C0_IC_COMP_PARAM_1_OFFSET)
#define RP2040_I2C0_IC_COMP_VERSION        (RP2040_I2C0_BASE + RP2040_I2C0_IC_COMP_VERSION_OFFSET)
#define RP2040_I2C0_IC_COMP_TYPE           (RP2040_I2C0_BASE + RP2040_I2C0_IC_COMP_TYPE_OFFSET)


/* Register bit definitions *************************************************/


#define RP2040_I2C0_IC_CON_STOP_DET_IF_MASTER_ACTIVE          (1 << 10)  /* Master issues the STOP_DET interrupt irrespective of whether master is active or not */
#define RP2040_I2C0_IC_CON_RX_FIFO_FULL_HLD_CTRL              (1 << 9)  /* Hold bus when RX_FIFO is full */
#define RP2040_I2C0_IC_CON_TX_EMPTY_CTRL                      (1 << 8)  /* Controlled generation of TX_EMPTY interrupt */
#define RP2040_I2C0_IC_CON_STOP_DET_IFADDRESSED               (1 << 7)  /* slave issues STOP_DET intr only if addressed */
#define RP2040_I2C0_IC_CON_IC_SLAVE_DISABLE                   (1 << 6)  /* Slave mode is disabled */
#define RP2040_I2C0_IC_CON_IC_RESTART_EN                      (1 << 5)  /* Master restart enabled */
#define RP2040_I2C0_IC_CON_IC_10BITADDR_MASTER                (1 << 4)  /* Master 10Bit addressing mode */
#define RP2040_I2C0_IC_CON_IC_10BITADDR_SLAVE                 (1 << 3)  /* Slave 10Bit addressing */
#define RP2040_I2C0_IC_CON_SPEED_SHIFT                        (1)  /* These bits control at which speed the DW_apb_i2c operates; its setting is relevant only if one is operating the DW_apb_i2c in master mode. Hardware protects against illegal values being programmed by software. These bits must be programmed appropriately for slave mode also, as it is used to capture correct value of spike filter as per the speed mode.  This register should be programmed only with a value in the range of 1 to IC_MAX_SPEED_MODE; otherwise, hardware updates this register with the value of IC_MAX_SPEED_MODE.  1: standard mode (100 kbit/s)  2: fast mode (<=400 kbit/s) or fast mode plus (<=1000Kbit/s)  3: high speed mode (3.4 Mbit/s)  Note: This field is not applicable when IC_ULTRA_FAST_MODE=1 */
#define RP2040_I2C0_IC_CON_SPEED_MASK                         (0x03 << RP2040_I2C0_IC_CON_SPEED_SHIFT)
#define RP2040_I2C0_IC_CON_SPEED_STANDARD                     (0x1 << RP2040_I2C0_IC_CON_SPEED_SHIFT)  /* Standard Speed mode of operation */
#define RP2040_I2C0_IC_CON_SPEED_FAST                         (0x2 << RP2040_I2C0_IC_CON_SPEED_SHIFT)  /* Fast or Fast Plus mode of operation */
#define RP2040_I2C0_IC_CON_SPEED_HIGH                         (0x3 << RP2040_I2C0_IC_CON_SPEED_SHIFT)  /* High Speed mode of operation */
#define RP2040_I2C0_IC_CON_MASTER_MODE                        (1 << 0)  /* Master mode is enabled */

#define RP2040_I2C0_IC_TAR_SPECIAL                            (1 << 11)  /* Enables programming of GENERAL_CALL or START_BYTE transmission */
#define RP2040_I2C0_IC_TAR_GC_OR_START                        (1 << 10)  /* START byte transmission */
#define RP2040_I2C0_IC_TAR_MASK                               (0x3ff)  /* This is the target address for any master transaction. When transmitting a General Call, these bits are ignored. To generate a START BYTE, the CPU needs to write only once into these bits.  If the IC_TAR and IC_SAR are the same, loopback exists but the FIFOs are shared between master and slave, so full loopback is not feasible. Only one direction loopback mode is supported (simplex), not duplex. A master cannot transmit to itself; it can transmit to only a slave. */

#define RP2040_I2C0_IC_SAR_MASK                               (0x3ff)  /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-bit addressing, only IC_SAR[6:0] is used.  This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  Note: The default values cannot be any of the reserved address locations: that is, 0x00 to 0x07, or 0x78 to 0x7f. The correct operation of the device is not guaranteed if you program the IC_SAR or IC_TAR to a reserved value. Refer to <<table_I2C_firstbyte_bit_defs>> for a complete list of these reserved values. */

#define RP2040_I2C0_IC_DATA_CMD_FIRST_DATA_BYTE               (1 << 11)  /* Non sequential data byte received */
#define RP2040_I2C0_IC_DATA_CMD_RESTART                       (1 << 10)  /* Issue RESTART before this command */
#define RP2040_I2C0_IC_DATA_CMD_STOP                          (1 << 9)  /* Issue STOP after this command */
#define RP2040_I2C0_IC_DATA_CMD_CMD                           (1 << 8)  /* Master Read Command */
#define RP2040_I2C0_IC_DATA_CMD_DAT_MASK                      (0xff)  /* This register contains the data to be transmitted or received on the I2C bus. If you are writing to this register and want to perform a read, bits 7:0 (DAT) are ignored by the DW_apb_i2c. However, when you read this register, these bits return the value of data received on the DW_apb_i2c interface.  Reset value: 0x0 */

#define RP2040_I2C0_IC_SS_SCL_HCNT_MASK                       (0xffff)  /* This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock high-period count for standard speed. For more information, refer to 'IC_CLK Frequency Configuration'.  This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  The minimum valid value is 6; hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed.  NOTE: This register must not be programmed to a value higher than 65525, because DW_apb_i2c uses a 16-bit counter to flag an I2C bus idle condition when this counter reaches a value of IC_SS_SCL_HCNT + 10. */

#define RP2040_I2C0_IC_SS_SCL_LCNT_MASK                       (0xffff)  /* This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock low period count for standard speed. For more information, refer to 'IC_CLK Frequency Configuration'  This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  The minimum valid value is 8; hardware prevents values less than this being written, and if attempted, results in 8 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of DW_apb_i2c. The lower byte must be programmed first, and then the upper byte is programmed. */

#define RP2040_I2C0_IC_FS_SCL_HCNT_MASK                       (0xffff)  /* This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock high-period count for fast mode or fast mode plus. It is used in high-speed mode to send the Master Code and START BYTE or General CALL. For more information, refer to 'IC_CLK Frequency Configuration'.  This register goes away and becomes read-only returning 0s if IC_MAX_SPEED_MODE = standard. This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  The minimum valid value is 6; hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH == 8 the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed. */

