yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_i2c0.h
#define RP2040_I2C0_IC_FS_SCL_LCNT_MASK                       (0xffff)  /* This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock low period count for fast speed. It is used in high-speed mode to send the Master Code and START BYTE or General CALL. For more information, refer to 'IC_CLK Frequency Configuration'.  This register goes away and becomes read-only returning 0s if IC_MAX_SPEED_MODE = standard.  This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  The minimum valid value is 8; hardware prevents values less than this being written, and if attempted results in 8 being set. For designs with APB_DATA_WIDTH = 8 the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed. If the value is less than 8 then the count value gets changed to 8. */

#define RP2040_I2C0_IC_INTR_STAT_R_MASTER_ON_HOLD             (1 << 13)  /* R_MASTER_ON_HOLD interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_RESTART_DET                (1 << 12)  /* R_RESTART_DET interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_GEN_CALL                   (1 << 11)  /* R_GEN_CALL interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_START_DET                  (1 << 10)  /* R_START_DET interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_STOP_DET                   (1 << 9)  /* R_STOP_DET interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_ACTIVITY                   (1 << 8)  /* R_ACTIVITY interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_RX_DONE                    (1 << 7)  /* R_RX_DONE interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_TX_ABRT                    (1 << 6)  /* R_TX_ABRT interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_RD_REQ                     (1 << 5)  /* R_RD_REQ interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_TX_EMPTY                   (1 << 4)  /* R_TX_EMPTY interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_TX_OVER                    (1 << 3)  /* R_TX_OVER interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_RX_FULL                    (1 << 2)  /* R_RX_FULL interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_RX_OVER                    (1 << 1)  /* R_RX_OVER interrupt is active */
#define RP2040_I2C0_IC_INTR_STAT_R_RX_UNDER                   (1 << 0)  /* RX_UNDER interrupt is active */

#define RP2040_I2C0_IC_INTR_MASK_M_MASTER_ON_HOLD_READ_ONLY   (1 << 13)  /* MASTER_ON_HOLD interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_RESTART_DET                (1 << 12)  /* RESTART_DET interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_GEN_CALL                   (1 << 11)  /* GEN_CALL interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_START_DET                  (1 << 10)  /* START_DET interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_STOP_DET                   (1 << 9)  /* STOP_DET interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_ACTIVITY                   (1 << 8)  /* ACTIVITY interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_RX_DONE                    (1 << 7)  /* RX_DONE interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_TX_ABRT                    (1 << 6)  /* TX_ABORT interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_RD_REQ                     (1 << 5)  /* RD_REQ interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_TX_EMPTY                   (1 << 4)  /* TX_EMPTY interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_TX_OVER                    (1 << 3)  /* TX_OVER interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_RX_FULL                    (1 << 2)  /* RX_FULL interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_RX_OVER                    (1 << 1)  /* RX_OVER interrupt is unmasked */
#define RP2040_I2C0_IC_INTR_MASK_M_RX_UNDER                   (1 << 0)  /* RX_UNDER interrupt is unmasked */

#define RP2040_I2C0_IC_RAW_INTR_STAT_MASTER_ON_HOLD           (1 << 13)  /* MASTER_ON_HOLD interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_RESTART_DET              (1 << 12)  /* RESTART_DET interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_GEN_CALL                 (1 << 11)  /* GEN_CALL interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_START_DET                (1 << 10)  /* START_DET interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_STOP_DET                 (1 << 9)  /* STOP_DET interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_ACTIVITY                 (1 << 8)  /* RAW_INTR_ACTIVITY interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_RX_DONE                  (1 << 7)  /* RX_DONE interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_TX_ABRT                  (1 << 6)  /* TX_ABRT interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_RD_REQ                   (1 << 5)  /* RD_REQ interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_TX_EMPTY                 (1 << 4)  /* TX_EMPTY interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_TX_OVER                  (1 << 3)  /* TX_OVER interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_RX_FULL                  (1 << 2)  /* RX_FULL interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_RX_OVER                  (1 << 1)  /* RX_OVER interrupt is active */
#define RP2040_I2C0_IC_RAW_INTR_STAT_RX_UNDER                 (1 << 0)  /* RX_UNDER interrupt is active */

#define RP2040_I2C0_IC_RX_TL_RX_TL_MASK                       (0xff)  /* Receive FIFO Threshold Level.  Controls the level of entries (or above) that triggers the RX_FULL interrupt (bit 2 in IC_RAW_INTR_STAT register). The valid range is 0-255, with the additional restriction that hardware does not allow this value to be set to a value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer. A value of 0 sets the threshold for 1 entry, and a value of 255 sets the threshold for 256 entries. */

#define RP2040_I2C0_IC_TX_TL_TX_TL_MASK                       (0xff)  /* Transmit FIFO Threshold Level.  Controls the level of entries (or below) that trigger the TX_EMPTY interrupt (bit 4 in IC_RAW_INTR_STAT register). The valid range is 0-255, with the additional restriction that it may not be set to value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer. A value of 0 sets the threshold for 0 entries, and a value of 255 sets the threshold for 255 entries. */

#define RP2040_I2C0_IC_CLR_INTR_CLR_INTR                      (1 << 0)  /* Read this register to clear the combined interrupt, all individual interrupts, and the IC_TX_ABRT_SOURCE register. This bit does not clear hardware clearable interrupts but software clearable interrupts. Refer to Bit 9 of the IC_TX_ABRT_SOURCE register for an exception to clearing IC_TX_ABRT_SOURCE.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_RX_UNDER_CLR_RX_UNDER              (1 << 0)  /* Read this register to clear the RX_UNDER interrupt (bit 0) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_RX_OVER_CLR_RX_OVER                (1 << 0)  /* Read this register to clear the RX_OVER interrupt (bit 1) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_TX_OVER_CLR_TX_OVER                (1 << 0)  /* Read this register to clear the TX_OVER interrupt (bit 3) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

