yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_i2c0.h
#define RP2040_I2C0_IC_CLR_RD_REQ_CLR_RD_REQ                  (1 << 0)  /* Read this register to clear the RD_REQ interrupt (bit 5) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_TX_ABRT_CLR_TX_ABRT                (1 << 0)  /* Read this register to clear the TX_ABRT interrupt (bit 6) of the IC_RAW_INTR_STAT register, and the IC_TX_ABRT_SOURCE register. This also releases the TX FIFO from the flushed/reset state, allowing more writes to the TX FIFO. Refer to Bit 9 of the IC_TX_ABRT_SOURCE register for an exception to clearing IC_TX_ABRT_SOURCE.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_RX_DONE_CLR_RX_DONE                (1 << 0)  /* Read this register to clear the RX_DONE interrupt (bit 7) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_ACTIVITY_CLR_ACTIVITY              (1 << 0)  /* Reading this register clears the ACTIVITY interrupt if the I2C is not active anymore. If the I2C module is still active on the bus, the ACTIVITY interrupt bit continues to be set. It is automatically cleared by hardware if the module is disabled and if there is no further activity on the bus. The value read from this register to get status of the ACTIVITY interrupt (bit 8) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_STOP_DET_CLR_STOP_DET              (1 << 0)  /* Read this register to clear the STOP_DET interrupt (bit 9) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_START_DET_CLR_START_DET            (1 << 0)  /* Read this register to clear the START_DET interrupt (bit 10) of the IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_CLR_GEN_CALL_CLR_GEN_CALL              (1 << 0)  /* Read this register to clear the GEN_CALL interrupt (bit 11) of IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_ENABLE_TX_CMD_BLOCK                    (1 << 2)  /* Tx Command execution blocked */
#define RP2040_I2C0_IC_ENABLE_ABORT                           (1 << 1)  /* ABORT operation in progress */
#define RP2040_I2C0_IC_ENABLE_ENABLE                          (1 << 0)  /* I2C is enabled */

#define RP2040_I2C0_IC_STATUS_SLV_ACTIVITY                    (1 << 6)  /* Slave not idle */
#define RP2040_I2C0_IC_STATUS_MST_ACTIVITY                    (1 << 5)  /* Master not idle */
#define RP2040_I2C0_IC_STATUS_RFF                             (1 << 4)  /* Rx FIFO is full */
#define RP2040_I2C0_IC_STATUS_RFNE                            (1 << 3)  /* Rx FIFO not empty */
#define RP2040_I2C0_IC_STATUS_TFE                             (1 << 2)  /* Tx FIFO is empty */
#define RP2040_I2C0_IC_STATUS_TFNF                            (1 << 1)  /* Tx FIFO not full */
#define RP2040_I2C0_IC_STATUS_ACTIVITY                        (1 << 0)  /* I2C is active */

#define RP2040_I2C0_IC_TXFLR_TXFLR_MASK                       (0x1f)  /* Transmit FIFO Level. Contains the number of valid data entries in the transmit FIFO.  Reset value: 0x0 */

#define RP2040_I2C0_IC_RXFLR_RXFLR_MASK                       (0x1f)  /* Receive FIFO Level. Contains the number of valid data entries in the receive FIFO.  Reset value: 0x0 */

#define RP2040_I2C0_IC_SDA_HOLD_IC_SDA_RX_HOLD_SHIFT          (16)  /* Sets the required SDA hold time in units of ic_clk period, when DW_apb_i2c acts as a receiver.  Reset value: IC_DEFAULT_SDA_HOLD[23:16]. */
#define RP2040_I2C0_IC_SDA_HOLD_IC_SDA_RX_HOLD_MASK           (0xff << RP2040_I2C0_IC_SDA_HOLD_IC_SDA_RX_HOLD_SHIFT)
#define RP2040_I2C0_IC_SDA_HOLD_IC_SDA_TX_HOLD_MASK           (0xffff)  /* Sets the required SDA hold time in units of ic_clk period, when DW_apb_i2c acts as a transmitter.  Reset value: IC_DEFAULT_SDA_HOLD[15:0]. */

#define RP2040_I2C0_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_SHIFT      (23)  /* This field indicates the number of Tx FIFO Data Commands which are flushed due to TX_ABRT interrupt. It is cleared whenever I2C is disabled.  Reset value: 0x0  Role of DW_apb_i2c:  Master-Transmitter or Slave-Transmitter */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_MASK       (0x1ff << RP2040_I2C0_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_SHIFT)
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT          (1 << 16)  /* Transfer abort detected by master */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX         (1 << 15)  /* Slave trying to transmit to remote master in read mode */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST        (1 << 14)  /* Slave lost arbitration to remote master */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO    (1 << 13)  /* Slave flushes existing data in TX-FIFO upon getting read command */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ARB_LOST                (1 << 12)  /* Master or Slave-Transmitter lost arbitration */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS         (1 << 11)  /* User initiating master operation when MASTER disabled */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT     (1 << 10)  /* Master trying to read in 10Bit addressing mode when RESTART disabled */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT      (1 << 9)  /* User trying to send START byte when RESTART disabled */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT         (1 << 8)  /* User trying to switch Master to HS mode when RESTART disabled */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET       (1 << 7)  /* ACK detected for START byte */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET          (1 << 6)  /* HS Master code ACKed in HS Mode */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ         (1 << 5)  /* GCALL is followed by read from bus */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK        (1 << 4)  /* GCALL not ACKed by any slave */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK       (1 << 3)  /* Transmitted data not ACKed by addressed slave */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK      (1 << 2)  /* Byte 2 of 10Bit Address not ACKed by any slave */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK      (1 << 1)  /* Byte 1 of 10Bit Address not ACKed by any slave */
#define RP2040_I2C0_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK      (1 << 0)  /* This abort is generated because of NOACK for 7-bit address */

