yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_i2c0.h
#define RP2040_I2C0_IC_SLV_DATA_NACK_ONLY_NACK                (1 << 0)  /* Slave receiver generates NACK upon data reception only */

#define RP2040_I2C0_IC_DMA_CR_TDMAE                           (1 << 1)  /* Transmit FIFO DMA channel enabled */
#define RP2040_I2C0_IC_DMA_CR_RDMAE                           (1 << 0)  /* Receive FIFO DMA channel enabled */

#define RP2040_I2C0_IC_DMA_TDLR_DMATDL_MASK                   (0x0f)  /* Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.  Reset value: 0x0 */

#define RP2040_I2C0_IC_DMA_RDLR_DMARDL_MASK                   (0x0f)  /* Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or more than this field value + 1, and RDMAE =1. For instance, when DMARDL is 0, then dma_rx_req is asserted when 1 or more data entries are present in the receive FIFO.  Reset value: 0x0 */

#define RP2040_I2C0_IC_SDA_SETUP_SDA_SETUP_MASK               (0xff)  /* SDA Setup. It is recommended that if the required delay is 1000ns, then for an ic_clk frequency of 10 MHz, IC_SDA_SETUP should be programmed to a value of 11. IC_SDA_SETUP must be programmed with a minimum value of 2. */

#define RP2040_I2C0_IC_ACK_GENERAL_CALL_ACK_GEN_CALL          (1 << 0)  /* Generate ACK for a General Call */

#define RP2040_I2C0_IC_ENABLE_STATUS_SLV_RX_DATA_LOST         (1 << 2)  /* Slave RX Data is lost */
#define RP2040_I2C0_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY  (1 << 1)  /* Slave is disabled when it is active */
#define RP2040_I2C0_IC_ENABLE_STATUS_IC_EN                    (1 << 0)  /* I2C enabled */

#define RP2040_I2C0_IC_FS_SPKLEN_MASK                         (0xff)  /* This register must be set before any I2C bus transaction can take place to ensure stable operation. This register sets the duration, measured in ic_clk cycles, of the longest spike in the SCL or SDA lines that will be filtered out by the spike suppression logic. This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect. The minimum valid value is 1; hardware prevents values less than this being written, and if attempted results in 1 being set. or more information, refer to 'Spike Suppression'. */

#define RP2040_I2C0_IC_CLR_RESTART_DET_CLR_RESTART_DET        (1 << 0)  /* Read this register to clear the RESTART_DET interrupt (bit 12) of IC_RAW_INTR_STAT register.  Reset value: 0x0 */

#define RP2040_I2C0_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_SHIFT     (16)  /* TX Buffer Depth = 16 */
#define RP2040_I2C0_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_MASK      (0xff << RP2040_I2C0_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_SHIFT)
#define RP2040_I2C0_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_SHIFT     (8)  /* RX Buffer Depth = 16 */
#define RP2040_I2C0_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_MASK      (0xff << RP2040_I2C0_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_SHIFT)
#define RP2040_I2C0_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS        (1 << 7)  /* Encoded parameters not visible */
#define RP2040_I2C0_IC_COMP_PARAM_1_HAS_DMA                   (1 << 6)  /* DMA handshaking signals are enabled */
#define RP2040_I2C0_IC_COMP_PARAM_1_INTR_IO                   (1 << 5)  /* COMBINED Interrupt outputs */
#define RP2040_I2C0_IC_COMP_PARAM_1_HC_COUNT_VALUES           (1 << 4)  /* Programmable count values for each mode. */
#define RP2040_I2C0_IC_COMP_PARAM_1_MAX_SPEED_MODE_SHIFT      (2)  /* MAX SPEED MODE = FAST MODE */
#define RP2040_I2C0_IC_COMP_PARAM_1_MAX_SPEED_MODE_MASK       (0x03 << RP2040_I2C0_IC_COMP_PARAM_1_MAX_SPEED_MODE_SHIFT)
#define RP2040_I2C0_IC_COMP_PARAM_1_APB_DATA_WIDTH_MASK       (0x03)  /* APB data bus width is 32 bits */
